Backend Library/app/Controllers/BukuController.php

    public function index()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('buku');
        $builder->select('buku.*, kategori.nama_kategori, stok.total_copy, stok.avail_copy');
        $builder->join('kategori', 'kategori.kategoriID = buku.kategoriID', 'left');
        $builder->join('stok', 'stok.bukuID = buku.bukuID', 'left');
        $query   = $builder->get();
---
SELECT *
FROM `buku`